var HomeData = {
    "pack_shop_list": [
        {
            "title": "喇叭",
            "intro": "双方都打发打发大多数",
            "num": "11",
            "type": "1",
            "time": "2018-01-01",
        },
        {
            "title": "小草",
            "intro": "用于装饰头像有效期7天",
            "num": "12",
            "type": "2",
            "time": "2018-02-02",
        },
        {
            "title": "萌萌哒",
            "intro": "用于装饰头像有效期7天",
            "num": "13",
            "type": "3",
            "time": "2018-03-03",
        },
        {

            "title": "花",
            "intro": "用于装饰头像有效期7天",
            "num": "14",
            "type": "4",
            "time": "2018-04-04",
        },
        {
            "title": "葫芦娃",
            "intro": "用于装饰头像有效期7天",
            "num": "15",
            "type": "5",
            "time": "2018-05-05",
        },
        {
            "title": "赌神",
            "intro": "用于装饰头像有效期7天",
            "num": "16",
            "type": "6",
            "time": "2018-06-06",
        },
        {
            "title": "招财猫",
            "intro": "用于装饰头像有效期7天",
            "num": "17",
            "type": "7",
            "time": "2018-07-07",
        },
    ],
    "signIn_list": [
        {"gold": "11000", "status": "2" },
        {"gold": "12000", "status": "2" },
        {"gold": "13000", "status": "2" },
        {"gold": "14000", "status": "2" },
        {"gold": "15000", "status": "2" },
        {"gold": "16000", "status": "2" },
        {"gold": "50000", "status": "1" },
    ],

    "email": {
        "friend_list": [
            {
                "user": {
                    "name": "西门吹雪1",
                    "id": "000001",
                },
                "time": "2018-08-11",
                "content": "风吹屁股凉风吹屁股凉风吹屁股凉风吹屁股凉1",
                "isGet": "0",
                "gold": "1000万",
                "isOpen": "1",
            },
            {
                "user": {
                    "name": "西门吹雪2",
                    "id": "000002",
                },
                "time": "2018-08-12",
                "content": "风吹屁股凉风吹屁股凉风吹屁股凉风吹屁股凉2",
                "isGet": "0",
                "gold": "2000万",
                "isOpen": "1",
            },
            {
                "user": {
                    "name": "西门吹雪3",
                    "id": "000003",
                },
                "time": "2018-08-13",
                "content": "风吹屁股凉风吹屁股凉风吹屁股凉风吹屁股凉3",
                "isGet": "0",
                "gold": "3000万",
                "isOpen": "1",
            },
            {
                "user": {
                    "name": "西门吹雪4",
                    "id": "000004",
                },
                "time": "2018-08-14",
                "content": "风吹屁股凉风吹屁股凉风吹屁股凉风吹屁股凉4",
                "isGet": "0",
                "gold": "",
                "isOpen": "1",
            },
            {
                "user": {
                    "name": "西门吹雪5",
                    "id": "000005",
                },
                "time": "2018-08-15",
                "content": "风吹屁股凉风吹屁股凉风吹屁股凉风吹屁股凉5",
                "isGet": "1",
                "gold": "10万亿",
                "isOpen": "1",
            },
        ],
        "system_email": [
            {
                "user": {
                    "name": "东方不败1",
                    "id": "000001",
                },
                "time": "2018-08-11",
                "content": "风吹屁股凉风吹屁股凉风吹屁股凉风吹屁股凉1",
                "isGet": "0",
                "gold": "1000万",
                "isOpen": "1",
            },
            {
                "user": {
                    "name": "东方不败2",
                    "id": "000002",
                },
                "time": "2018-08-12",
                "content": "风吹屁股凉风吹屁股凉风吹屁股凉风吹屁股凉2",
                "isGet": "0",
                "gold": "2000万",
                "isOpen": "1",
            },
            {
                "user": {
                    "name": "东方不败3",
                    "id": "000003",
                },
                "time": "2018-08-13",
                "content": "风吹屁股凉风吹屁股凉风吹屁股凉风吹屁股凉3",
                "isGet": "0",
                "gold": "3000万",
                "isOpen": "1",
            },
            {
                "user": {
                    "name": "东方不败4",
                    "id": "000004",
                },
                "time": "2018-08-14",
                "content": "风吹屁股凉风吹屁股凉风吹屁股凉风吹屁股凉4",
                "isGet": "0",
                "gold": "",
                "isOpen": "1",
            },
            {
                "user": {
                    "name": "东方不败5",
                    "id": "000005",
                },
                "time": "2018-08-15",
                "content": "风吹屁股凉风吹屁股凉风吹屁股凉风吹屁股凉5",
                "isGet": "0",
                "gold": "10万亿",
                "isOpen": "1",
            },
        ],
        "system_msg": [
            {
                "content": "您于18:24领取了 XXX 在好友邮件中发送的 100万金币。1",
                "time": "12月11日",
                "isOpen": "0",
            },
            {
                "content": "您于18:24领取了 XXX 在好友邮件中发送的 100万金币。2",
                "time": "12月12日",
                "isOpen": "0",
            },
            {
                "content": "您于18:24领取了 XXX 在好友邮件中发送的 100万金币。3",
                "time": "12月13日",
                "isOpen": "0",
            },
            {
                "content": "您于18:24领取了 XXX 在好友邮件中发送的 100万金币。4",
                "time": "12月14日",
                "isOpen": "1",
            },
            {
                "content": "您于18:24领取了 XXX 在好友邮件中发送的 100万金币。5",
                "time": "12月15日",
                "isOpen": "1",
            },
            {
                "content": "您于18:24领取了 XXX 在好友邮件中发送的 100万金币。6",
                "time": "12月16日",
                "isOpen": "1",
            },
        ],
    },
};

module.exports = HomeData;